import { Article } from './Article';

export const ARTICLES: Article[] = [
  { id: 1,
    image: 'http://www.pariteni.bg/image.php?path=L25pZGF0YS9hcHBzL3Bhcml0ZW5pL3Bhcml0ZW5pLmJnL3d3dy9tdWx0aW1lZGlhL3Bob3Rvcy9uZXcvaXRlbV9tYWM0NTkxOTY2NDAuanBn&w=374&h=251',
    title: 'Рекорден спад в печалбата на Google',
    description: `Чистата печалба на Alphabet - компанията майка на Google, през второто тримесечие намалява с 28% на годишна база до 3.5 млрд. долара, пише Financial Times. Изданието отбелязва, че това е най-големият спад в нетната печалба компанията от 2008 г. насам.
Aphabet обаче увеличава приходите през годината с 21% до 26 млрд. долара, което е по-високо от прогнозата на анализаторите, които предричаха приходи от 25.65 млрд. долара.
Негативен ефект върху печалбата на технологичния гигант има глобата, която Европейската комисия наложи на Google през юни. Според обвинението компанията е злоупотребила с господстващо положение на пазара, осигурявайки предимство в резултатите от търсене на собствените си продукти.
Въпреки че запази правото си да обжалва санкцията, компанията вече плати глобата в размер на 2.42 млрд. евро. В рамките на 90 дни Google може да предложи решение, което да удовлетвори регулаторите на ЕС, или ще трябва да плаща допълнителни глоби.`,
    author: 'Иван Иванов'
  },
  { id: 2,
    image: 'http://static.economic.bg/news/8/76509/item_internet.jpg',
    title: 'Google иска да направи интернет по-бърз',
    description: `Инженерите на Google разработват нов алгоритъм за контрол на претоварването, който след като бъде интегриран, ще бъде в състояние да ускори целия интернет, пише Futurism. 

Идеята е, че технологиите напредват безпрецедентно бързо и на този фон понякога изглежда, че интернет сякаш изостава. Ако обаче неговата скорост се подобри, това вероятно ще позволи на възникващите технологии да се разгърнат и процъфтят, както и да се даде тласък на научните изследвания, които са вече в ход. Инженерите в Google добре разбират всичко това и по тази причина вече са се заловили за работа. Компанията планира да допринесе са повишаването на скоростта, като създаде нов алгоритъм за контрол на претоварването – BBR (Bandwidth Bandwidth and Round-Trip Propagation Time).

Въпросният алгоритъм BBR бе стандартизиран през 80-те години на миналия век. В основата си той се характеризира с това, че разбира кога мрежата е претоварена и реагира чрез забавяне на трансфера на данни. На пръв поглед той не изглежда като нещо особено значимо или фундаментално, но всъщност се оказва, че играе огромна роля за интернет скоростта. 

В момента BBR е достъпен за компании и физически лица, ползващи платформата Google Cloud. Сега обаче гигантът реши да предприеме крачка напред, като сподели алгоритъма публично и го включи в TCP стандарта. Очаква се, че този ход ще се се отрази цялостно на интернет, смятат анализатори. 

Ако този алгоритъм всъщност бъде включен в интернет стандарта, въздействието му може да се окаже огромно. Дори ако скоростта се увеличи само с няколко процента, това може да се окаже повече от просто редуциране на незначителните неудобства и дразненията от бавната връзка. 

Идеята е, че днес почти всеки аспект от живота ни зависи от възможността ни да прехвърляме данни онлайн. Започвайки с международните комуникации и се стигне до разработването на софтуер и технологичните иновации, начините, по които интернет движи обществото ни, са безкрайни. Специалистите са на мнение, че повишаването на скоростта ще допринесе за цялостния напредък на сферата. 

През 80-те години на миналия век все още бе трудно да се разбере колко далеч може да ни отведе интернет или пък колко бързо ще можем да сърфираме в уеб пространството. Сега остава да видим как този около 30-годишен универсален инструмент ще бъде интегриран в съвременните условия и дали ще оправдае схващането, че понякога една малка стъпка може да се окаже крачка отвъд прага към нещо по-добро и голямо. `,
    author: 'Иван Иванов'
  },
  { id: 3,
    image: 'http://static.economic.bg/news/8/76465/item_66.jpg',
    title: '19-те най-продуктивни икономики в света',
    description: `Производителността е един от ключовите измерители на икономическия успех.
Ново изследване на групата Expert Market дава светлина върху държавите, в които работниците са най-продуктивни.
Подреждането е направено, като БВП наглава от населението е разделен на часовете, изработени от един работещ и така се получава резултатът  - кои нации правят най-много пари за най-малко време.
Цифрите сочат стойността, която всеки работник допринася за страната си за един работен час (в британски лири) за 2017 г..
Вижте 19-те най-продуктивни големи икономики в света:
19. Израел – 15,95 лири
18. Япония – 17,21 лири
17. Великобритания – 17,37 лири
16. Нова Зеландия – 18,07 лири
15. Франция – 19,51 лири
14. Канада – 19,72 лири
13. Финландия – 19,85 лири
12. Австрия – 21,06 лири
11. Германия – 23,30 лири
10. Швеция – 23,67 лири
9. Холанидя – 24,04 лири
8. Ирландия – 25,44 лири
7. Австралия – 25,47 лири
6. САЩ – 25,74 лири
5. Исландия – 27,63 лири
4. Дания – 28,87 лири
3. Швейцария – 37,89 лири
2. Норвегия – 39,72 лири
1. Люксембург – 51,80 лири
За сравнение в България, която не присъства в класацията, БВП на един отработен човекочас по текущи цени за 2016 г. е 16,3 лева, според данните на НСИ.`,
    author: 'Иван Иванов'
  },
  { id: 4,
    image: 'http://static.economic.bg/news/8/76496/item_13.jpg',
    title: 'Кои са най-търсените стоки на изплащане в България',
    description: `Най-търсената стока, купувана на изплащане през първата половина на 2017 г. е смартфонът, като най-купуваният модел е среден клас на цена 450-500 лв. Това показва класацията "Топ 10 на изплащане", от БНП Париба Лични Финанси. На второ място се нареждат телевизорите. В периода януари - юни 2017 г. най-търсеният телевизор е на средна цена 1000-1050 лв. 

Осем от най-търсените стоки през разглеждания период са за домакинството. Това са телевизори, перални, хладилници, готварски печки, дивани, обзавеждане за спалня, матраци и климатици. Единствените стоки, които не са пряко свързани с дома, са смартфоните и лаптопите.

Нараства търсенето на обзавеждане и климатици, в резултат на ръста на строителството и раздвижването в сектора на недвижимите имоти. Климатиците заемат 10-а позиция в класацията. Най-търсеният модел е на средна цена 1050 - 1100 лв. 

Данните в класацията на БНП Париба Лични Финанси показват, че българите инвестират в домашен комфорт и са готови да отделят повече пари за по-висок клас обзавеждане и техника, които ще използват дълго време. 

Класацията е базирана на над 150 000 стоки, за които клиентите кандидатстват за покупка на изплащане през първата половина на 2017 г. Около 50% от тях са за 10-те най-търсени стоки.`,
    author: 'Иван Иванов'
  },
  { id: 5,
    image: 'http://static.economic.bg/news/8/76438/item_canaryislands.jpg',
    title: 'Откриха 4 тона злато в потънал нацистки кораб',
    description: `Служители на британската компания Advanced Marine Services (AMS) са открили сандък с голямо количество злато в потънал германски кораб от Втората световна война край бреговете на Исландия. Предполага се, че благородният метал е откраднат от банки в Южна Америка и че тежи около 4 тона. 

Смята се, че златото е било доставено от сътрудници на "Banco Germanico", дъщерно подразделение на Германската дрезденска банка, съобщава БНТ. 

Сандъкът е открит в пощенското помещение на нацисткия кораб Minden, който през септември 1939 г., непосредствено след избухването на Втората световна война, е плавал от Бразилия в посока Германия. Корабът е бил забелязан от британски крайцери и по заповед на Адолф Хитлер той бива потопен, за да не се даде възможност товарът му да бъде конфискуван. 

С мотива, че находките принадлежат на открилия ги, сега AMS иска да отнесе златото  във Великобритания. За целта компанията е поискала от исландското правителство разрешение да пробие дупка в корпуса на кораба и да вдигне сандъка на повърхността. Очаква се местните власти скоро да дадат становище чия собственост е златото, което се намира в Атлантическия океан на 190 км (120 мили) югоизточно от Исландия.`,
    author: 'Иван Иванов'
  }
]
